<?xml version="1.0" ?>
<net name="paddle2onnx_model" version="10">
	<layers>
		<layer id="0" name="Constant@135/EltwiseUnsqueeze15976_const" type="Const" version="opset1">
			<data offset="0" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@135">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant@134/EltwiseUnsqueeze15972_const" type="Const" version="opset1">
			<data offset="4" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@134">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant@99/EltwiseUnsqueeze15896_const" type="Const" version="opset1">
			<data offset="0" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@99">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant@98/EltwiseUnsqueeze15892_const" type="Const" version="opset1">
			<data offset="4" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@98">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant@93/EltwiseUnsqueeze15880_const" type="Const" version="opset1">
			<data offset="0" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@93">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant@92/EltwiseUnsqueeze15876_const" type="Const" version="opset1">
			<data offset="4" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@92">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant@71/EltwiseUnsqueeze15832_const" type="Const" version="opset1">
			<data offset="0" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@71">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant@70/EltwiseUnsqueeze15828_const" type="Const" version="opset1">
			<data offset="4" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@70">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant@65/EltwiseUnsqueeze15816_const" type="Const" version="opset1">
			<data offset="0" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@65">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant@64/EltwiseUnsqueeze15812_const" type="Const" version="opset1">
			<data offset="4" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant@23/EltwiseUnsqueeze15704_const" type="Const" version="opset1">
			<data offset="0" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@23">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant@22/EltwiseUnsqueeze15700_const" type="Const" version="opset1">
			<data offset="4" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@22">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant@17/EltwiseUnsqueeze15688_const" type="Const" version="opset1">
			<data offset="0" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@17">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant@16/EltwiseUnsqueeze15684_const" type="Const" version="opset1">
			<data offset="4" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant@5/EltwiseUnsqueeze15672_const" type="Const" version="opset1">
			<data offset="0" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@5">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant@4/EltwiseUnsqueeze15668_const" type="Const" version="opset1">
			<data offset="4" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="image" type="Parameter" version="opset1">
			<data shape="1,3,512,512" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="BatchNormalization@0/mean/Fused_Mul_1677616778_const" type="Const" version="opset1">
			<data offset="8" size="1728" shape="16,3,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv1_weights">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv@0" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_1488115562/EltwiseUnsqueeze16000_const" type="Const" version="opset1">
			<data offset="1736" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="BatchNormalization@0/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_0.tmp_3,Cast@0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant@1/EltwiseUnsqueeze15664_const" type="Const" version="opset1">
			<data offset="1800" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant@0/EltwiseUnsqueeze15660_const" type="Const" version="opset1">
			<data offset="1804" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Constant@0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Mul@0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Mul@0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Add@0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="tmp_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Clip@0" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu6_0.tmp_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Mul@1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="tmp_1,Cast@1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Mul@2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Mul@2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Add@1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="tmp_2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="BatchNormalization@1/mean/Fused_Mul_1678016782_const" type="Const" version="opset1">
			<data offset="1808" size="1024" shape="16,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv2_expand_weights">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv@1" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_148841488915564/EltwiseUnsqueeze16008_const" type="Const" version="opset1">
			<data offset="2832" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="BatchNormalization@1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_1.tmp_3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Relu@0" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_0.tmp_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="2979529798_const" type="Const" version="opset1">
			<data offset="2896" size="576" shape="16,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv2_depthwise_weights">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv@2" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="data_add_148921489715566/EltwiseUnsqueeze16016_const" type="Const" version="opset1">
			<data offset="3472" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="BatchNormalization@2/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_2.tmp_3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Relu@1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_1.tmp_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="BatchNormalization@3/mean/Fused_Mul_1678816790_const" type="Const" version="opset1">
			<data offset="3536" size="1024" shape="16,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv2_linear_weights">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv@3" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_149001490515568/EltwiseUnsqueeze16024_const" type="Const" version="opset1">
			<data offset="4560" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="BatchNormalization@3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_3.tmp_3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Add@2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_0.tmp_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="BatchNormalization@4/mean/Fused_Mul_1679216794_const" type="Const" version="opset1">
			<data offset="4624" size="4096" shape="64,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv3_expand_weights">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv@4" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="data_add_149081491315570/EltwiseUnsqueeze16032_const" type="Const" version="opset1">
			<data offset="8720" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="BatchNormalization@4/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_4.tmp_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Relu@2" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_2.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="2976329766_const" type="Const" version="opset1">
			<data offset="8976" size="2304" shape="64,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv3_depthwise_weights">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv@5" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="data_add_149161492115572/EltwiseUnsqueeze16040_const" type="Const" version="opset1">
			<data offset="11280" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="BatchNormalization@5/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_5.tmp_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Relu@3" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_3.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="BatchNormalization@6/mean/Fused_Mul_1680016802_const" type="Const" version="opset1">
			<data offset="11536" size="6144" shape="24,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv3_linear_weights">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv@6" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_149241492915574/EltwiseUnsqueeze16048_const" type="Const" version="opset1">
			<data offset="17680" size="96" shape="1,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="BatchNormalization@6/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_6.tmp_3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="BatchNormalization@7/mean/Fused_Mul_1680416806_const" type="Const" version="opset1">
			<data offset="17776" size="6912" shape="72,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv4_expand_weights">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv@7" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="data_add_149321493715576/EltwiseUnsqueeze16056_const" type="Const" version="opset1">
			<data offset="24688" size="288" shape="1,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="BatchNormalization@7/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_7.tmp_3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Relu@4" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_4.tmp_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="2977129774_const" type="Const" version="opset1">
			<data offset="24976" size="2592" shape="72,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv4_depthwise_weights">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv@8" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_add_149401494515578/EltwiseUnsqueeze16064_const" type="Const" version="opset1">
			<data offset="27568" size="288" shape="1,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="BatchNormalization@8/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_8.tmp_3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Relu@5" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_5.tmp_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="BatchNormalization@9/mean/Fused_Mul_1681216814_const" type="Const" version="opset1">
			<data offset="27856" size="6912" shape="24,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv4_linear_weights">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv@9" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="data_add_149481495315580/EltwiseUnsqueeze16072_const" type="Const" version="opset1">
			<data offset="34768" size="96" shape="1,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="BatchNormalization@9/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_9.tmp_3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Add@3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_1.tmp_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="BatchNormalization@10/mean/Fused_Mul_1681616818_const" type="Const" version="opset1">
			<data offset="34864" size="6912" shape="72,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv5_expand_weights">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv@10" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_149561496115582/EltwiseUnsqueeze16080_const" type="Const" version="opset1">
			<data offset="41776" size="288" shape="1,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="BatchNormalization@10/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_10.tmp_3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Relu@6" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_6.tmp_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="2979129794_const" type="Const" version="opset1">
			<data offset="42064" size="7200" shape="72,1,1,5,5" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv5_depthwise_weights">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv@11" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="2,2" pads_end="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="data_add_149641496915584/EltwiseUnsqueeze16088_const" type="Const" version="opset1">
			<data offset="49264" size="288" shape="1,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="BatchNormalization@11/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_11.tmp_3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Relu@7" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_7.tmp_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="881/Output_0/Data__const" type="Const" version="opset1">
			<data offset="49552" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="84" name="GlobalAveragePool@0/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="GlobalAveragePool@0/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="GlobalAveragePool@0/input_rank/0d_rank_of/value/Output_0/Data__const" type="Const" version="opset1">
			<data offset="49560" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="GlobalAveragePool@0/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="88" name="883/Output_0/Data__const" type="Const" version="opset1">
			<data offset="49568" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="89" name="GlobalAveragePool@0/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0"/>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="GlobalAveragePool@0/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="pool2d_0.tmp_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv5_se_1_weights/Output_0/Data__const" type="Const" version="opset1">
			<data offset="49576" size="5184" shape="18,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv5_se_1_weights">
					<dim>18</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv@12" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>18</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_8.tmp_0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape@0/Output_0/Data__const" type="Const" version="opset1">
			<data offset="54760" size="72" shape="1,18,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Reshape@0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Add@4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_8.tmp_1">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Relu@8" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_8.tmp_2">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="conv5_se_2_weights/Output_0/Data__const" type="Const" version="opset1">
			<data offset="54832" size="5184" shape="72,18,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv5_se_2_weights">
					<dim>72</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv@13" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_9.tmp_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Reshape@1/Output_0/Data__const" type="Const" version="opset1">
			<data offset="60016" size="288" shape="1,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Reshape@1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Add@5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_9.tmp_1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="HardSigmoid@0/HardSigmoid__input_port_1/value/Output_0/Data__const" type="Const" version="opset1">
			<data offset="60304" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="HardSigmoid@0/HardSigmoid__input_port_2/value/Output_0/Data__const" type="Const" version="opset1">
			<data offset="60308" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="HardSigmoid@0/HardSigmoid_" type="HardSigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="conv2d_9.tmp_2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Mul@3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_mul_0.tmp_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="BatchNormalization@12/mean/Fused_Mul_1682416826_const" type="Const" version="opset1">
			<data offset="60312" size="11520" shape="40,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv5_linear_weights">
					<dim>40</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv@14" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="data_add_149721497715586/EltwiseUnsqueeze16096_const" type="Const" version="opset1">
			<data offset="71832" size="160" shape="1,40,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="BatchNormalization@12/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_12.tmp_3">
					<dim>1</dim>
					<dim>40</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="BatchNormalization@13/mean/Fused_Mul_1682816830_const" type="Const" version="opset1">
			<data offset="71992" size="19200" shape="120,40,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv6_expand_weights">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv@15" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="data_add_149801498515588/EltwiseUnsqueeze16104_const" type="Const" version="opset1">
			<data offset="91192" size="480" shape="1,120,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="BatchNormalization@13/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_13.tmp_3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Relu@9" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_8.tmp_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="2978729790_const" type="Const" version="opset1">
			<data offset="91672" size="12000" shape="120,1,1,5,5" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="conv6_depthwise_weights">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv@16" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="2,2" pads_end="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="data_add_149881499315590/EltwiseUnsqueeze16112_const" type="Const" version="opset1">
			<data offset="103672" size="480" shape="1,120,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="BatchNormalization@14/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_14.tmp_3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Relu@10" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_9.tmp_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="886/Output_0/Data__const" type="Const" version="opset1">
			<data offset="49552" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="119" name="GlobalAveragePool@1/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="GlobalAveragePool@1/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
